Checking Final Deployment
